other-codes/openfoam-toolchain-with-gmsh-main/Simulation_Outputs/test_2/simpleFoam-2D/4_freestream_kwSST_cp/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         _VARendTime_;

deltaT          1;

writeControl    runTime;

writeInterval   _VARwriteInterval_;

purgeWrite      0;

writeFormat     _VARwriteFormat_;

writePrecision  _VARwritePrecision_;

writeCompression off;

timeFormat      general;

timePrecision   _VARtimePrecision_;

runTimeModifiable true;

functions
{
			forceCoeffs1
	{
	    type            forceCoeffs;
        libs ( "libforces.so" );
        writeControl   timeStep;
        writeInterval  1;
        patches         (_VARnameSTLwithoutExtension___VARnameSTLwithoutExtension_ _VARnameSTLwithoutExtension___VARnameSTLwithoutExtension_FLAP);
        rho             rhoInf;
        log             true;
        rhoInf          1.177;
        liftDir         (_VARliftDirX_ _VARliftDirY_ _VARliftDirZ_);
        dragDir         (_VARdragDirX_ _VARdragDirY_ _VARdragDirZ_);
        CofR            (0.25 0 0);
        pitchAxis       (0 0 1);
        magUInf         _VARmagUinf_;
        lRef            _VARlref_;
        Aref            _VARAref_;
	}

	yPlus1
	{
	type yPlus;
	libs ( "libfieldFunctionObjects.so" );
         writeControl   timeStep;
         writeInterval  500;
	}
	
	#includeFunc	residuals;	

};


// ************************************************************************* //
