other-codes/openfoam-toolchain-with-gmsh-main/Simulation_Outputs/test_2/simpleFoam-2D/4_freestream_kwSST_cp/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    "_VARnameSTLwithoutExtension_.*"
    {
        type            zeroGradient;
    }

    topAndBottom
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    front
    {
        type            empty;
    }
	
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
